In [33]:
import numpy as np
import pandas as pd
import numpy.random as randn

In [2]:
dic={'Rahul':[25,26,27],'Shyam':[33,34,35],'Ram':[40,44,45]}
df=pd.DataFrame(dic)
df

   Rahul  Shyam  Ram
0     25     33   40
1     26     34   44
2     27     35   45

In [3]:
df['Rahul']>25

0    False
1     True
2     True
Name: Rahul, dtype: bool

In [7]:
temptable=df[df['Rahul']>25]

In [8]:
temptable

   Rahul  Shyam  Ram
1     26     34   44
2     27     35   45

In [12]:
temptable[['Shyam','Ram']]

   Shyam  Ram
1     34   44
2     35   45

In [16]:
df[df['Rahul']>25]['Shyam']

1    34
2    35
Name: Shyam, dtype: int64

In [17]:
df.drop(1,axis=0)

   Rahul  Shyam  Ram
0     25     33   40
2     27     35   45

In [18]:
df.loc[0,'Rahul']

25

In [19]:
df

   Rahul  Shyam  Ram
0     25     33   40
1     26     34   44
2     27     35   45

In [20]:
len(df.index)

3

In [21]:
df.loc[len(df.index)]=[77,85,93]

In [22]:
df

   Rahul  Shyam  Ram
0     25     33   40
1     26     34   44
2     27     35   45
3     77     85   93

In [25]:
df[(df['Rahul']>33) & (df['Ram']>44)]

   Rahul  Shyam  Ram
3     77     85   93

In [26]:
df.reset_index()

   index  Rahul  Shyam  Ram
0      0     25     33   40
1      1     26     34   44
2      2     27     35   45
3      3     77     85   93

In [27]:
newlist=[88,89,90,91]
df['Shivam']=newlist
df

   Rahul  Shyam  Ram  Shivam
0     25     33   40      88
1     26     34   44      89
2     27     35   45      90
3     77     85   93      91

In [28]:
mainlist=['Maharashtra','Maharashtra','karnataka','karnataka']
sublist=['Pune','Mumbai','Bangalore','Hubli']
table=list(zip(mainlist,sublist))
newdf=pd.MultiIndex.from_tuples(table)
newdf

MultiIndex([('Maharashtra',      'Pune'),
            ('Maharashtra',    'Mumbai'),
            (  'karnataka', 'Bangalore'),
            (  'karnataka',     'Hubli')],
           )

In [30]:
fixedtable=pd.DataFrame(newdf)

In [31]:
fixedtable

                        0
0     (Maharashtra, Pune)
1   (Maharashtra, Mumbai)
2  (karnataka, Bangalore)
3      (karnataka, Hubli)

In [36]:
pd.DataFrame(newdf,['Jan','Feb'])

ValueError: Shape of passed values is (4, 1), indices imply (2, 1)